permissionTitle = 'Добро пожаловать коллега! Напишите мне, я все передам кадрам, выходите, проспали и тд, все передам :)) Не переживайте, за это у нас не ругают 😉'

permissions = [
    '😬 Опоздаю',
    '🏢 В офисе, но опоздал',
    '👔 По делам офиса',
    '🚫 Не смогу прийти',
    '🏃🏼‍ По личным делам',
    '🏠 Работаю из дома'
]

days = [
    'Сегодня',
    'Завтро',
    '⬅️ Вернутсья'
]

reasons = [
    {
        'name': '😬 Опоздаю',
        'title': 'Не хорошо это опаздывать, давайте, введите причину опоздания, все таки мы люди, всякое бывает, понимаем 😉',
        'list': [
            'Проспал, досмотрел сон',
            'Пробки',
            'Универ завет',
            'Был у врача',
            'Свой Вариант',
            '⬅️ Вернутсья'
        ]
    },
    {
        'name': '🏢 В офисе, но опоздал',
        'title': 'А мы думали вы не напишите)) Шучу, какова причина опоздания?',
        'list': [
            'Проспал, досмотрел сон',
            'Гаишник остановил',
            'Пробки',
            'Универ завет',
            'Был у врача',
            'Свой Вариант',
            '⬅️ Вернутсья'
        ]
    },
    {
        'name': '👔 По делам офиса',
        'title': 'Круто, заодно свежим воздухом подышите, увидите мир😅',
        'list': [
            'Еду к партнеру',
            'Еду купит товары для офиса',
            'Нужно в налоговую',
            'Свой Вариант',
            '⬅️ Вернутсья'
        ]
    },
    {
        'name': '🚫 Не смогу прийти',
        'title': 'Все в порядке? Почему вы не сможете прийти?',
        'list': [
            'По домашним делам',
            'Экзамен',
            'Устал чуть отдохну',
            'Универ завет',
            'По состоянию здоровья',
            'Свой Вариант',
            '⬅️ Вернутсья'
        ]
    },
    {
        'name': '🏃‍♂ По личным делам',
        'title': 'Поняли! Примерно во сколько вернетесь? Выберите часы:',
        'list': []
    },
    {
        'name': '🏠 Работаю из дома',
        'title': 'Даа дома работается чудесно? Введите, пожалуйста, время начало работы Выберите часы:',
        'list': []
    }
]

endTime = [
    {
        'name': 'hour',
        'title': 'А во сколько начнете работу? Выберите часы:',
        'title1': 'Во сколько начали работу? Выберите часы:',
        'title2': 'Примерно во сколько вернетесь? Выберите часы:',
        'list': [
            '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '⬅️ Вернутсья'
        ]
    },
    {
        'name': 'minute',
        'title': 'Выберите минуты',
        'list': [
            '00', '05', '10', '15', '20', '25', '30', '35', '40', '45', '50', '55', '⬅️ Вернутсья'
        ]
    }
]

approval = {
    'permission': '',
    'reason': '',
    'account': '',
    'timeHour': '',
    'timeMinute': '',
}

